{"details":[{"location":"Barcelona","stackoverflow":{"badges":["Critic","Yearling","Popular Question","Scholar","Nice Answer","Commentator","Editor","Teacher","Documentation User","Autobiographer","Self-Learner","Necromancer","Notable Question","Supporter"]}}],"projects":[{"title":"seam-project-studios/osiris-ojs","description":"Javascript templates .ojs rendered to a writable stream","date":"Aug 2018 → Current\r\n                    (1 year, 6 months)","url":"https://github.com/seam-project-studios/osiris-ojs"},{"title":"Caixa Obra Social Info Forms","description":"I developed the news and information application forms for Caixa's Obra Social fund whilst at BeRepublic. Based on the Open source template system developed by me and my associate at our company seam.es. These outputted separate flat HTML files that were then integrated into Salesforce.\n\nAlthough a very basic concept we wanted to be able to build out all the different forms in different languages. Whilst still sharing styles and elements for ease of development. \n\nThe developer experience was then in line with new paradigms but still, outputted a single HTML file for the upload HTML file button available in salesforce.","date":"Sep 2018","url":"https://cloud.news.obrasociallacaixa.org/jemprendedor?lang=pt"},{"title":"Sabadell Reto","description":"Reto is the name to an internal application used by the Sabadell Bank, this allowed users to see where in the rankings of all the Sabadell offices they where positioned.\n\nIn an existing project, there were some pain points that had to be handled. Such as deployment being done within there internal Citrix system, making it hard to test live. Additionally testing against the API locally was also difficult due to this limitation. So I helped to develop a mock library for the PHP back end and rebuilt all the react components into separate components and pages. Where previously everything was in the components folder.","date":"Jun 2018"},{"title":"Barnavisuals.cat","description":"Designed and developed the landing page for Barnavisuals, a close friends photography project","date":"Jan 2018","url":"https://barnavisuals.cat/"},{"title":"gigya/node-gigya-boilerplate","description":"Boilerplate Node.js App using the Gigya accountJS RaaS","date":"Jan 2017 → Nov 2017\r\n                    (11 months)","url":"https://github.com/gigya/node-gigya-boilerplate"},{"title":"Ojo API integrity tester","description":"Whilst at Gigya now SAP Gigya we where working with multiple digital properties across the world for the nestle account, due to large administrator users i.e agencies and digital marketeers for Nestel brands I designed and lead an initiative to develop Ojo. A Node app allowing us to define the settings for each digital property as we released them. using the Gigya API it then took these configs (written in YAML) and tested them against the digital properties settings. Allowing us to be alerted when anything had changed. We could then reach out to the admin who changed it and either update the configuration checks. or fix any mistakes that may have been made when adapting those settings. \n\nthis allowed our whole team to become more proactive in managing the properties and ensuring the RaaS to function as intended.","date":"Sep 2017"},{"title":"maxmckenzie/gigya-webpack-boilerplate","description":"Example Gigya CDN SDK integration using webpack","date":"Aug 2017 → Aug 2017\r\n                    (1 month)","url":"https://github.com/maxmckenzie/gigya-webpack-boilerplate"},{"title":"Fat Rat Films Website","description":"Designed and developed a website for fat rat films that serves as a catalogue of all their films. Each video is loaded only on click to reduce the epic load time you try to load 20 youtube videos at once.","date":"Sep 2016","url":"http://www.fatratfilms.co.uk/"},{"title":"FrontEndSeed","description":"FrontEndSeed is a template project for developing static websites","date":"Oct 2015 → Sep 2016\r\n                    (1 year)","url":"https://github.com/maxmckenzie/FrontEndSeed"},{"title":"Developer Documentation BookingBug","description":"Wrote, designed and developed the developer documentation for the BookingBug Platform","date":"Apr 2016","url":"https://dev.jrni.com/"},{"title":"Cleanovation Website","description":"Designed and developed a website for a cleaning company in London called Cleanovation","date":"Mar 2016","url":"http://www.cleanovation.co.uk/"},{"title":"pre-flight visual communication (archive.org)","description":"Developed a portfolio site for pre-flight visual communication.","date":"Feb 2016","url":"https://web.archive.org/web/20160927045517/http://pfvc.co.uk/"},{"title":"ChangeThePicture","description":"Designed and developed the ChangeThePciture website in node.js which runs off of an API of all their 360 degree photography","date":"Jan 2016","url":"https://changethepicture.co.uk/"},{"title":"lemondigits.com (archive.org)","description":"Front end website for the company I Co-founded with my business partner Ben.","date":"Jan 2015","url":"https://web.archive.org/web/20160305205342/http://lemondigits.com/"},{"title":"Bat Country Festival (archive.org)","description":"I developed the ticket sales website for EMSP's festival \"Bat Country\" using designs provided by them, using Stripe as the payment platform.","date":"Aug 2014","url":"https://web.archive.org/web/20160120003943/https://batcountryfestival.com/"},{"title":"gentlemystics.com (archive.org)","description":"The Gentle Mystics are an excellent band from the UK (here's one of my favorites). They came to us to redevelop their website from page designs provided to us and implement WordPress as the CMS.","date":"Jan 2014","url":"https://web.archive.org/web/20150213005615/http://gentlemystics.com/"},{"title":"The Morning Star - Android App (archive.org)","description":"Design and UI development of the Morning Star app. Allowing\npaying subscribers to access the entire paper on an Android phone or tablet. Containing all the same news, features and sport as the printed paper, the app is now available at the touch of a button wherever you are in the world. Read your paper on the go, browse back issues, or access a printable PDF copy.","date":"Sep 2013","url":"https://web.archive.org/web/20160901000000/https://play.google.com/store/apps/details?id=uk.co.morningstar.duty"},{"title":"Morning Star (archive.org)","description":"The only English-language socialist daily newspaper in the world, published six days a week. est 1930. I worked with all the stakeholders from the paper, and conducted interviews with staff to design a custom CMS and UI to let users subscribe, download PDF copies of the paper and allowed the paper to publish their online edition via the front end website. Alas they have a new site now and i no longer work on the project.","date":"Sep 2013","url":"https://web.archive.org/web/20170625061424/http://morningstaronline.co.uk/"}],"education":[{"title":"Cert HE Commercial Music, University of Westminster","date":"Sep 2010 → Sep 2012"},{"title":"A-Levels, Hayesfield, Bath","date":"2006 → 2008"}],"skills":[{"skills":["node","vue","react","docker","nightwatch","webpack","mocha","sinon","graphql"]}],"workHistory":[{"title":"Co-Founder at        \r\n            Seam","tags":["google-cloud-platform","vue.js","graphql","nightwatch","heroku","gitlab"],"description":"Based in Barcelona, we provide digital solutions for organisations, companies, and individuals. We involve our clients at all stages of the process so there are no surprises or hidden costs, everything is upfront and honest.","date":"Aug 2017 → Current\r\n                    (2 years, 7 months)"},{"title":"Contract Developer at        \r\n            BeRepublic","tags":["reactjs","vue.js","vuex"],"description":"Barcelona, ES | Embedded with one of the teams as lead I worked on projects for Bank Sabadell, Caixa, BeRepublic and Targo Bank. Helping to estimate on specifications, developing interfaces for greenfield projects with modern tools such as Vue and React. I was also taking lead to support the existing codebases and bring down onboarding time for developers.","date":"Apr 2018 → Nov 2018\r\n                    (8 months)"},{"title":"Senior Developer at        \r\n            Papayapods","tags":["vue.js","feathersjs","devops","docker","azure","auth0","apollo"],"description":"Barcelona, ES | Papayapods created and operated https://papayapods.com a SaaS product to help landlords and housing professionals to manage their whole rental journeys digitally. I achieved better collaboration and workflow practices by setting up CI/CD workflows. Deploying multiple client white-label applications and their core offering. I also got assigned as tech lead for one of their largest clients https://helvetia.ch who required a custom product to meet there needs.","date":"May 2017 → Jan 2018\r\n                    (9 months)"},{"title":"Technical Consultant at        \r\n            Gigya","tags":["yaml","node","saml","jwt","chai","sinon","webpack","mocha","encryption","authentication","oauth-2.0","selenium-webdriver"],"description":"Barcelona, ES | Onsite consultation with Nestle’s CIAM team. Helping to guide developers working on implementing the service by building JavaScript prototypes. Working with the QA team to better isolate test scenarios using the Gigya API. I also spear-headed the development of a custom testing and auditing solution for oversite on the thousands of digital properties they have across the world.","date":"Jan 2017 → Nov 2017\r\n                    (11 months)"},{"title":"Co-founder UX/UI Developer at LemonDigits","tags":["node.js","babel","webpack","ruby","capybara","cucumber","rspec","gherkin","cordova","stylus","gruntjs","twig","handlebars.js","underscore.js","express","sass","less","oojavascript","jquery","svn","git","css","oophp","html","mysql"],"description":"London, UK | LemonDigits was an agency I ran in London employing 3-4 developers. Designing, developing and maintaining web and mobile applications for companies, cooperatives, individuals, and publishers. It came about through a collaboration on my freelance work with friends who were also programmers. I managed and developed projects, communicated with the clients, got in work and projects and managed the administration as the company director.","date":"Aug 2012 → Sep 2016\r\n                    (4 years, 2 months)"},{"title":"Contract Senior QA at        \r\n            BookingBug","tags":["node.js","babel","ruby","capybara","cucumber","rspec","gherkin","ecmascript-6","webdriverio","commander","commonjs"],"description":"London, UK | Whilst working as the technical writer for BookingBug. I started working with the QA team to help plan out a structure and workflow for the automated end to end testing of the embedded widget and core API. This included researching and building a few different prototypes in different languages and libraries to allow the QA team to test all of their bespoke client applications in a common language with a common style.","date":"Jul 2016 → Aug 2016\r\n                    (2 months)"},{"title":"Contract Technical Writer at        \r\n            BookingBug","tags":["node.js","babel","ruby","capybara","cucumber","rspec","gherkin","gruntjs","twig","express","less","ecmascript-6","jquery","git","commonjs"],"description":"London, UK | Worked with the senior management, support and development teams to design, develop and write the developer documentation https://dev.bookingbug.com (now jrni https://dev.jrni.com/). Used by third-party developers to integrate with the BookingBug SaaS platform.","date":"Jan 2016 → Aug 2016\r\n                    (8 months)"},{"title":"Contract Front End Developer at        \r\n            Tribal Worldwide","tags":["node.js","java","grails","gruntjs","assemble","handlebars.js","larevel","cordova","sass","oojavascript","jquery","svn","git","css","php","html","mysql"],"description":"London, UK | I contracted at Tribal part-time working mainly on the vw.co.uk BAU team. But occasionally worked on other accounts such as Esso and Lipton. This job was where I seriously cut my teeth. I went in with MAMP installed having never opened the terminal and left with grunt, assemble, handlebars, node, even a bit of Java/Grails under my belt.I highly rate this agency. It has got a really nice working environment and a very professional approach.","date":"Sep 2014 → Sep 2015\r\n                    (1 year, 1 month)"},{"title":"Guest tutor (outside professional) at Hackney UTC","tags":["photoshop","adobe-illustrator"],"description":"London, UK | I was invited to Hackney UTC as an outside professional to lead a five-week course in Digital Graphic Design, taking students through why to use digital graphics, how to develop an idea from project to style guide. Setting a client brief with the aim of each student creating a promotional package Inline with a radio station project they had been working on previously. Teaching was fun. Scary. But fun.","date":"Jan 2014 → Feb 2014\r\n                    (2 months)"},{"title":"IT Administrator, UX Designer at Wildoak Residential","tags":["php","jquery","indesign","photoshop"],"description":"Bath, UK | Helped to design a bespoke CMS for managing the property data and customer data. Maintained the website and the creation of marketing materials such as client brochures, window cards, TV displays and all other relevant graphic design, including the launch of Wildoak International and Wildoak Magazine.","date":"Aug 2010 → Feb 2012\r\n                    (1 year, 7 months)"},{"title":"Web Design/Development at Freelance","tags":["php","css","jquery","wordpress"],"description":"Bath/London, UK | multiple web projects some based on WordPress some not. This was the driving force in my career as i realised that I did not want to continue my commercial music career and switched to a full-time developer. Creating and maintaining small websites for different clients.","date":"Jan 2010 → Feb 2012\r\n                    (2 years, 2 months)"},{"title":"Creator at CrossOver Sounds","tags":["php","css","photoshop","jquery"],"description":"Bath, UK | At 18 I started a record label. Researching copyright signing up to the PPL, buying EAN codes from GS1, and partnering with a digital aggregator Kontor New Media to distribute a few artists I knew and their work to all the major online stores. I also organised club nights under the label in my hometown of Bath.","date":"Aug 2008 → Aug 2010\r\n                    (2 years, 1 month)"}],"githubCode":[]}