{"projects":[{"title":"seam-project-studios/webpack","description":"A full-featured Webpack + vue-loader setup with hot reload, linting, testing & css extraction.","date":"Dec 2017 → Current\n                    (1 month)","url":"https://github.com/seam-project-studios/webpack"},{"title":"maxmckenzie/docker-alpine-ruby-node","description":"Docker image to support a node app build with compass and sass via ruby gems. all very specific for a certain project with some exact gem versions.","date":"Nov 2017 → Nov 2017\n                    (1 month)","url":"https://github.com/maxmckenzie/docker-alpine-ruby-node"},{"title":"maxmckenzie/gigya-webpack-boilerplate","description":"Example Gigya CDN SDK integration using webpack","date":"Aug 2017 → Aug 2017\n                    (1 month)","url":"https://github.com/maxmckenzie/gigya-webpack-boilerplate"},{"title":"Fat Rat Films Website","description":"Designed and developed a website for fat rat films that serves as a catalogue of all their films. Each video is loaded only on request.Whilst working as the technical writer for BookingBug. I started working with the QA team to help plan out a structure and workflow for an automated end to end testing strategery. This included researching and building a few different libraries in different languages to allow the QA team to test all of their bespoke client applications in a common gherkin based language.\n\nThese snippets could then be used by the project management team to define the scope of work and hand over to the QA and UX teams.\n\nUsing a boilerplate from webdriverio I created a default set of gherkin steps that would work across the ruby testing library and the webdriverio testing library. The Snippets for sublime can be found here https://github.com/maxmckenzie/Default-Gherkin-Sublime-Snippets\n\nReference: Jack Fenton | Test Lead at BookingBug\n\"Max has a full understanding of web technologies, from designing bespoke solutions from the ground up in the command line to browser/UI automation and everything in between.\"","date":"Sep 2016","url":"http://www.fatratfilms.co.uk/"},{"title":"FrontEndSeed","description":"FrontEndSeed is a template project for developing static websites","date":"Oct 2015 → Sep 2016\n                    (1 year)","url":"https://github.com/maxmckenzie/FrontEndSeed"},{"title":"Developer Documentation BookingBug","description":"Wrote, designed and developed the developer documentation for the BookingBug Platform","date":"Apr 2016","url":"https://dev.bookingbug.com/"},{"title":"Cleanovation Website","description":"Designed and developed a website for a cleaning company in London called Cleanovation","date":"Mar 2016","url":"http://www.cleanovation.co.uk/"},{"title":"pre-flight visual communication","description":"Developed a portfolio site for pre-flight visual communication.","date":"Feb 2016","url":"http://www.pfvc.co.uk/"},{"title":"ChangeThePicture","description":"Designed and developed the ChangeThePciture website in node.js which runs off of an API of all their 360 degree photography","date":"Jan 2016","url":"http://changethepicture.com"},{"title":"rb-cookies","description":"scrape a website for all the cookies used. Useful when someone asks you to audit a cookie policy.","date":"Mar 2015 → Sep 2015\n                    (7 months)","url":"https://github.com/maxmckenzie/rb-cookies"},{"title":"The Morning Star - Android Apps on Google Play","description":"The Morning Star app allows paying subscribers to access the entire paper on an Android phone or tablet. Containing all the same news, features and sport as the printed paper, the app is now available at the touch of a button wherever you are in the world. Read your paper on the go, browse back issues, or access a printable PDF copy.\n\nDesign and front end development","date":"Sep 2013","url":"https://play.google.com/store/apps/details?id=uk.co.morningstar.duty"},{"title":"Morning Star","description":"The only English-language socialist daily newspaper in the world, published six days a week. est 1930\n\nAll round developer front end and functionality","date":"Sep 2013","url":"http://www.morningstaronline.co.uk/"}],"workhistory":[{"title":"Co-Founder at         \n            Seam","tags":[],"description":"Professional services, operated by me and a guy called ben in Barcelona","date":"Aug 2017 → Current\n                    (6 months)"},{"title":"Senior Developer at         \n            Papayapods","tags":["vue.js","feathersjs","devops","docker","azure","auth0","apollo"],"date":"May 2017 → Current\n                    (9 months)"},{"title":"Technical Consultant at         \n            Gigya","tags":["yaml","node","saml","jwt","chai","sinon","webpack","mocha","encryption","authentication","oauth-2.0","selenium-webdriver"],"description":"Worked with Gigya onsite consulting on the implementation of the registration as a service. Helping to guide developers working on implementing the service. Building JS prototypes. Working with their QA developer to better isolate test scenarios using the Gigya API, developing open source boilerplates and developing a custom testing solutions","date":"Jan 2017 → Nov 2017\n                    (11 months)"},{"title":"Co-founder UX/UI Developer at LemonDigits","tags":["node.js","babel","webpack","ruby","capybara","cucumber","rspec","gherkin","cordova","stylus","gruntjs","twig","handlebars.js","underscore.js","express","sass","less","oojavascript","jquery","svn","git","css","oophp","html","mysql"],"description":"Lemon Digits designs, develops and deploys software and web applications for companies and individuals, as well as offering managed services. We are a group of freelancers who pooled our skills together to allow us to take on contracts personally or through LemonDigits.\n\nI am was in charge of managing projects and communicating the clients' ideas to create a project that meets their goals and return on investment, making sure user testing and feedback are implemented within the development process. Writing specifications and helping the team to develop the interfaces and some of the back-end functionality.","date":"Aug 2012 → Sep 2016\n                    (4 years, 2 months)"},{"title":"Contract Senior QA at         \n            BookingBug","tags":["node.js","babel","ruby","capybara","cucumber","rspec","gherkin","ecmascript-6","webdriverio","commander","commonjs"],"description":"Whilst working as the technical writer for BookingBug. I started working with the QA team to help plan out a structure and workflow for an automated end to end testing. This included researching and building a few different libraries in different languages to allow the QA team to test all of their bespoke client applications in a common gherkin based language.\n\nThese snippets could then be used by the project management team to define the scope of work and hand over to the QA and UX teams.\n\nUsing a boilerplate from webdriverio I created a default set of gherkin steps that would work across the ruby testing library and the webdriverio testing library. The Snippets for sublime can be found here https://github.com/maxmckenzie/Default-Gherkin-Sublime-Snippets\n\n\"Max has a full understanding of web technologies, from designing bespoke solutions from the ground up in the command line to browser/UI automation and everything in between\".\n\nJack Fenton - Test Lead at BookingBug","date":"Jul 2016 → Aug 2016\n                    (2 months)"},{"title":"Contract Technical Writer at         \n            BookingBug","tags":["node.js","babel","ruby","capybara","cucumber","rspec","gherkin","gruntjs","twig","express","less","ecmascript-6","jquery","git","commonjs"],"description":"Working with the developers and senior management to design, develop and write the developer documentation https://dev.bookingbug.com/. Used by third-party developers to integrate with the BookingBug platform.\n\nI helped them to define the information architecture. Communicating with the different internal teams and directly communicating with enterprise clients to find out what information was needed.\n\nI also created the style guide for the documentation regarding the use of English suffixes tonality and structure of documentation. Along with pull request and issue templates and a Github workflow. Allowing the teams to handle updating the documentation with ease via markdown.\n\n\"Amazingly talented developer and technical writer. Max is a great self-starter who with loose guidelines can be trusted to return amazing work. Would recommend to anyone who was in need of his skill set\".\n\nGreg Bock - Co-Founder at BookingBug","date":"Jan 2016 → Aug 2016\n                    (8 months)"},{"title":"Contract Front End Developer at Tribal Worldwide","tags":["node.js","java","grails","gruntjs","assemble","handlebars.js","larevel","cordova","sass","oojavascript","jquery","svn","git","css","php","html","mysql"],"description":"I contracted at Tribal part time working mainly on the vw.co.uk BAU team. But occasionally I worked on other accounts such as Esso and Lipton. I was employed on the frontend team working with multiple technologies and frameworks such as Java, Grails, Grunt, Assemble, SASS, Javascript, SVN and Git. I highly rate this agency. It has got a really nice working environment and a very professional Approach.\n\n\"Max, Max, Max. How I miss this man. I really put him through his paces when he joined the team. But he was more than up to the challenge. He's a great problem solver, a pragmatist and a pretty fine Developer\".\n\nStewart Birch - Technical Director at Cohaesus\n\n\"Max is a highly skilled and reliable developer. I worked with Max for one year at Tribal Worldwide and during that time I quickly got to know and appreciate Max’s skills. Max has good knowledge of front end development, he has experience with working on large scale web sites for big name clients, he is able to work under pressure and can be relied upon to devise fitting solutions given tight time constraints which I feel is a valuable trait which is lacking in a lot of todays developers\".\n\nDaniel Ivanovic - Creative & Technical Director, Antiblanks Ltd\n\n\"Max is a good at what he does: he's one of those developers you can rely on to deliver the build on time or fix the bug. He's a talented front-end coder, is sharp and gets it, and ultimately is a doer - someone you want on your team. He came for a couple of weeks contract, and stayed over a year\".\n\nJustin Vir - Operations Director at Tribal Worldwide","date":"Sep 2014 → Sep 2015\n                    (1 year, 1 month)"},{"title":"Guest tutor (outside professional) at Hackney UTC","tags":[],"description":"I was invited to Hackney UTC as an outside professional to lead a five-week course in Digital Graphic Design, taking students through why to use digital graphics, how to use digital graphics correctly and setting a client brief with the aim of each student creating a promo package and style guide in line with a radio station project they had been working on.","date":"Jan 2014 → Feb 2014\n                    (2 months)"},{"title":"Digital Consultant at IP Ventures","tags":[],"description":"Started by an associate, IP Ventures was a project I worked on as a consultant, advising on digital assets such as colour palette, font stylings and contributing to scoping the brand position and overall marketing direction. As well as implementing and developing the client facing website.","date":"Aug 2012 → Dec 2012\n                    (5 months)"},{"title":"Contract Developer at BioPharma Asia Magazine","tags":[],"description":"BioPharma Asia hired me on a three-month contract to design and develop a website for a new biopharmaceutical publication, creating all aspects of the website to handle subscriptions, user permissions, news aggregation and digital editions.","date":"Jul 2012 → Aug 2012\n                    (2 months)"},{"title":"Freelance Contractor - Web Developer at Ignite Hospitality","tags":[],"description":"I work on a temp basis, creating html and css templates from PSD (photoshop) designs. as well as consulting on commercial aspects of the web development process chain.","date":"Apr 2012 → May 2012\n                    (2 months)"},{"title":"IT Administrator, UX Designer at Wildoak Residential","tags":[],"description":"Training staff to use the bespoke CMS and Software. In addition to this i helped develop and deisgn the website based on a bespoke CMS written from scratch. I also contributed in the creation of marketing material, designing client brochures, window cards, TV displays and all other relevant graphic design, including the launch of Wildoak International and Wildoak Magazine.","date":"Aug 2010 → Feb 2012\n                    (1 year, 7 months)"},{"title":"Web Design/Development at Freelance","tags":[],"description":"multiple web projects some based on WordPress Some Not","date":"Jan 2010 → Feb 2012\n                    (2 years, 2 months)"},{"title":"Shop Manager at Splash of London","tags":[],"description":"Got invaluable experience working here during the time i had off of my degree, i was in charge of the shop whilst the owner was away and was the main web developer for incoming projects. I learned invaluable experience. and I haven't wanted to through a printer out of a window since.\n\nMy responsibility’s included\nManaging the shop, running print jobs to a professional standard, organising the process chain, printing t-shirts, serving customers, developing clients web sites along with marketing materials and assets.","date":"Apr 2011 → Jan 2012\n                    (10 months)"},{"title":"Creator at CrossOver Sounds","tags":[],"description":"Record Label, Production, Promotion and Management of multiple artists. Included is a new way of viewing the music industry. Through Creative Commons.","date":"Aug 2008 → Aug 2010\n                    (2 years, 1 month)"}],"education":[{"title":"Cert HE Commercial Music, University of Westminster","date":"Sep 2010 → Sep 2012"},{"title":"A-Levels, Hayesfield, Bath","date":"2006 → 2008"}],"skills":[{"skills":["node","vue","react","docker","nightwatch","webpack","mocha","sinon","graphql"]}],"details":[{"location":"Barcelona","stackoverflow":{"badges":["Documentation User","Commentator","Popular Question","Supporter","Necromancer","Autobiographer","Editor","Scholar","Yearling","Notable Question","Self-Learner","Teacher"]},"github":{"contributions":"255 contributions\n      in the last year"}}],"code":[{"title":"portfolio-frontend","url":"/maxmckenzie/portfolio-frontend","tags":[],"numbers":[]},{"title":"node-gigya-boilerplate","url":"/gigya/node-gigya-boilerplate","tags":[],"numbers":[]},{"title":"portfolio-frontend","url":"/maxmckenzie/portfolio-frontend","description":"Front end VueJS application to display data from the portfolio API","tags":[],"numbers":["10\n              \n              commits","1\n            \n            branch","0\n            \n            releases","Fetching contributors"]},{"title":"portfolio-API","url":"/maxmckenzie/portfolio-API","description":"REST API that serves my CV/Portfolio","tags":["osmosis","nodejs","babel","restify"],"numbers":["20\n              \n              commits","1\n            \n            branch","0\n            \n            releases","1\n    \n    contributor"]},{"title":"node-gigya-boilerplate","url":"/gigya/node-gigya-boilerplate","description":"Boilerplate Node.js App using the Gigya accountJS Raas service","tags":["babel","mocha","chimp","gigya-client","gigya","nodemon","e2e-tests","cucumberjs","gherkin"],"numbers":["46\n              \n              commits","4\n            \n            branches","0\n            \n            releases","1\n    \n    contributor"]},{"title":"vue-webpack-boilerplate","url":"/maxmckenzie/vue-webpack-boilerplate","tags":[],"numbers":[]},{"title":"node-bable-standardjs-boilerplate","url":"/maxmckenzie/node-bable-standardjs-boilerplate","description":"node bable standardjs boilerplate","tags":["mocha","babel","nodejs","standard-js","eslint","boilerplate"],"numbers":["7\n              \n              commits","2\n            \n            branches","0\n            \n            releases","Fetching contributors"]},{"title":"vue-webpack-boilerplate","url":"/maxmckenzie/vue-webpack-boilerplate","description":"Boilerplate created with vue v2 webpack, authentication via firebase","tags":["vue-webpack","vue-loader","boilerplate","firebase","express"],"numbers":["23\n              \n              commits","1\n            \n            branch","0\n            \n            releases","Fetching contributors"]},{"title":"gigya-webpack-boilerplate","url":"/maxmckenzie/gigya-webpack-boilerplate","description":"Example Gigya CDN SDK integration using webpack","tags":["gigya","gigya-screensets","webpack3","boilerplate","eslint","babel"],"numbers":["6\n              \n              commits","1\n            \n            branch","0\n            \n            releases","Fetching contributors"]}]}